Revit 2024 API
ParameterTypeId.RebarMaxLength Property
 "Maximum bar length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarMaxLength { get; }
Visual Basic
Public Shared ReadOnly Property RebarMaxLength As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarMaxLength {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace